# Используем официальный образ Go как базовый
FROM golang:1.20-alpine as builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app


# Копируем все остальные файлы проекта в контейнер
COPY . .

# Скачиваем все зависимости
RUN  go mod tidy

# Собираем приложение
RUN go build -o main

# Начинаем новую стадию сборки на основе минимального образа
FROM alpine:latest

# Добавляем исполняемый файл из первой стадии в корневую директорию контейнера
COPY --from=builder /app/main /main

# Открываем порт 8080
EXPOSE 8080

# Запускаем приложение
CMD ["/main"]
